package edu.princeton.cs.exercise.chapter2_4;

/**
 * 2.4.5 Give the heap that results when the keys E A S Y Q U E S T I O N are inserted in that order
 * into an initially empty max-oriented heap.
 *
 * <p>给出当键按照 E A S Y Q U E S T I O N 的顺序插入一个初始为空的面向最大堆的结果堆
 *
 * @author LeonChen
 * @since 9/15/20
 */
class E02_04_05 {

  /**
   * <code>
   *     输入                      结果
   *     E                         E
   *
   * ----------------------------------------------
   *     A                         E
   *                            A
   *
   * -----------------------------------------------
   *     S                         S
   *                            A     E
   *
   * ---------------------------------------------------
   *     Y                         Y
   *                            S     E
   *                         A
   *
   * ---------------------------------------------------
   *     Q                         Y
   *                            S     E
   *                          A   Q
   *
   * -----------------------------------------------------
   *     U                          Y
   *                             S     U
   *                           A   Q E
   *
   * -----------------------------------------------------
   *     E                          Y
   *                             S     U
   *                           A   Q E   E
   *
   * -----------------------------------------------------
   *     S                          Y
   *                         S             U
   *                       S   Q         E   E
   *                     A
   *
   * -----------------------------------------------------
   *     T                          Y
   *                         T             U
   *                       S   Q         E   E
   *                     A   S
   *
   * -----------------------------------------------------
   *     I                          Y
   *                         T             U
   *                    S         Q      E   E
   *                  A   S     I
   *
   * -----------------------------------------------------
   *     O                          Y
   *                         T             U
   *                    S         Q      E   E
   *                  A   S     I   O
   *
   * -----------------------------------------------------
   *     N                          Y
   *                         T             U
   *                    S         Q      N   E
   *                  A   S     I   O  E
   *
   *
   * </code>
   */
  public static void main(String[] args) {}
}
