package edu.princeton.cs.exercise.chapter2_4;

/**
 * 2.4.8 Answer the previous exercise for the kth smallest item.
 *
 * <p>如果是求第 k 个最小项的情况如何回答前面的问题
 *
 * @author LeonChen
 * @since 9/17/20
 */
class E02_04_08 {

  /**
   * <code>
   *
   *                          1
   *            2                         3
   *       4           5             6            7
   *   8     9     10      11    12     13    14    15
   * 16 17 18 19  20 21  22 23  24 25  26 27 28 29 30 31
   *
   * 上一题正好组成一个满二叉树,所以可以不用考虑非满二叉树的特殊情况.
   *
   * 也就是说倒数第i层的元素一定至少是 2(i-1)+1个元素中的最大值,也就是第2(i-1)+1个最小元素.
   *
   * k = 2 时, 第 k 小的值会在 倒数第一层 也就是 16 17 18 19  20 21  22 23  24 25  26 27 28 29 30 31
   * k = 3 时, 第 k 大的值会在倒数第1,2层 8 9 10 11 12 13 14 15 16 17 18 19  20 21  22 23  24 25  26 27 28 29 30 31
   * k = 4 时, 第 k 大的值会在倒数第1,2层 8 9 10 11 12 13 14 15 16 17 18 19  20 21  22 23  24 25  26 27 28 29 30 31
   *
   * </code>
   */
  public static void main(String[] args) {}
}
