package edu.princeton.cs.exercise.chapter2_4;

/**
 * 2.4.9 Draw all of the different heaps that can be made from the five keys A B C D E, then draw
 * all of the different heaps that can be made from the five keys A A A B B.
 *
 * <p>绘制出使用5个键 A B C D E 能组成的所有不同的堆,然后绘制出使用5个键 A A A B B 能组成的所有不同的堆.
 *
 * @author LeonChen
 * @since 9/17/20
 */
class E02_04_09 {

  /**
   * <code>
   * 最大堆的情况下:
   * 首先分析  A B C D E 的情况: 可以组成一个3层的堆,如下
   *                      1
   *                2           3
   *            4      5
   *
   * 此时根结点一定会是 E, 2节点一定会比4,5两个节点大,所以2节点可以D,C.
   * 当2节点是D时,剩下3个位置可以任意摆放.也就是挑出两个放在4,5 ,剩下一个放在3.A(3,2)=6种.
   * 当2节点时C时,3节点必须是D.也就是说2个位置,2个元素. A(2,1) = 2.
   * 总共也就是 6+2=8种排列方式.
   *
   *
   * 1.
   *                       E
   *                D           C
   *            A      B
   * ---------------------------------------------------------------
   * 2.
   *                       E
   *                D           C
   *            B      A
   * ---------------------------------------------------------------
   * 3.
   *                       E
   *                C           D
   *            A      B
   * ---------------------------------------------------------------
   * 4.
   *                       E
   *                C           D
   *            B      A
   * ---------------------------------------------------------------
   * 5.
   *                       E
   *                D           A
   *            C      B
   * ---------------------------------------------------------------
   * 6.
   *                       E
   *                D           A
   *            B      C
   * ---------------------------------------------------------------
   * 7.
   *                       E
   *                D           B
   *            A      C
   * ---------------------------------------------------------------
   * 8.
   *                       E
   *                D           B
   *            C      A
   * ---------------------------------------------------------------
   *
   *
   *
   *
   * 接着是 A A A B B 的情况: 可以组成一个3层的堆,如下
   *                      1
   *                2           3
   *            4      5
   *
   * 同理此时根结点一定会是 B, 2节点一定会比4,5两个节点大,所以2节点可以B,A.
   * 如果只按照值比较来看,2节点可以是 A,B.
   * 此时只剩下 AA , 所以 4,5 没的选.
   * 也就是说 只有两种堆
   *
   * ---------------------------------------------------------------
   * 1.
   *                       B
   *                A           B
   *            A      A
   * ---------------------------------------------------------------
   * 2.
   *                       B
   *                B           A
   *            A      A
   * ---------------------------------------------------------------
   *
   * </code>
   */
  public static void main(String[] args) {}
}
